/*        Болле простой вариант        */
let week = ["Понедельник", "Вторник", "Среда",
            "Четверг", "Пятница", "<b>Суббота</b>", "<b><i>Воскресенье</i></b>"];

for (let i = 0; i < week.length; i++) { //7
        document.write(week[i] + "<br>"); //Выводит в столбик
}

let arr = ["12345", "789", "456", "713", "3315", "398657", "54"];

arr.forEach((e) => { //forEach выполняет функцию один раз для каждого элемента в массиве.
  if (e[0] == '3' || e[0] == '7') { // Логический оператор ИЛИ
    document.write(" <br>" + e); // Можно записать иначе (`<br>${e}`)
  }
});